bench-results/local-raw-nvme-pgbench-tuned-20260805T235747Z/simple-c64-r2.log
pgbench (17.10 (Debian 17.10-0+deb13u1))
starting vacuum...end.
progress: 5.0 s, 25892.3 tps, lat 2.445 ms stddev 1.375, 0 failed
progress: 10.0 s, 25913.0 tps, lat 2.469 ms stddev 1.417, 0 failed
progress: 15.0 s, 26088.4 tps, lat 2.451 ms stddev 1.376, 0 failed
progress: 20.0 s, 25634.2 tps, lat 2.496 ms stddev 1.672, 0 failed
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 100
query mode: simple
number of clients: 64
number of threads: 8
maximum number of tries: 1
duration: 20 s
number of transactions actually processed: 517703
number of failed transactions: 0 (0.000%)
latency average = 2.465 ms
latency stddev = 1.465 ms
initial connection time = 50.293 ms
tps = 25939.910448 (without initial connection time)
statement latencies in milliseconds and failures:
         0.000           0  \set aid random(1, 100000 * :scale)
         0.000           0  \set bid random(1, 1 * :scale)
         0.000           0  \set tid random(1, 10 * :scale)
         0.000           0  \set delta random(-5000, 5000)
         0.029           0  BEGIN;
         0.057           0  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
         0.051           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
         0.129           0  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
         0.632           0  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
         0.034           0  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
         1.534           0  END;